[
  {
    "id": "remoteok_1129610",
    "title": "Principal Product Manager",
    "company": "PolicyMe",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-principal-product-manager-policyme-1129610",
    "postedDate": "2026-01-18T08:34:10.630991",
    "fetchedAt": "2026-01-18T08:34:10.630998",
    "raw": {
      "slug": "remote-principal-product-manager-policyme-1129610",
      "id": "1129610",
      "epoch": 1768636826,
      "date": "2026-01-17T08:00:26+00:00",
      "company": "PolicyMe",
      "company_logo": "",
      "position": "Principal Product Manager",
      "tags": [
        "manager",
        "design",
        "technical",
        "support",
        "growth",
        "financial",
        "fintech",
        "leader",
        "strategy",
        "management",
        "lead",
        "operational",
        "health",
        "engineering",
        "digital nomad"
      ],
      "description": "<p><b>Overview of the role:</b></p><p>Weâ\u0080\u0099re on a mission to modernize insurance - making it simpler, more accessible, and customer-first. The insurance industry is a $1T market thatâ\u0080\u0099s remained largely untouched by the digital revolution, and PolicyMe is here to change that. As a remote-first, Toronto-based startup with big ambitions, weâ\u0080\u0099re looking for a product leader to help us build the future of insurance in Canada - and beyond.</p><p><br></p><p>Weâ\u0080\u0099re now seeking a <b>Principal Product Manager</b> to lead and scale our Health Insurance business. This product leadership role will have end-to-end ownership over the product vision, the strategy, and the execution of our health insurance product roadmap. This is a pivotal role, reporting to the VP of Product and working closely with multiple teams across the organization.</p>\\n<p></p><p><br></p><b>What you'll be doing</b><ul><li><b>Define &amp; Own the Product Vision:</b></li><li>Evolve our product strategy to meet ambitious growth, retention, and customer impact goals that you will own.</li><li>Set a compelling long-term product vision for our health insurance vertical, aligned with business priorities and grounded in customer insights.</li><li>Champion a roadmap that balances innovation with operational excellence.</li><li>Understand your product and customer context deeply - you are comfortable building strong domain knowledge and being an expert in your category, which you can then apply to the vision for your portfolio</li><li>Establish OKRs that helps your team progress towards the long-term version</li><li><b>Drive End-to-end Execution and Delivery:</b></li><li>While youâ\u0080\u0099ll shape the big picture, itâ\u0080\u0099s not just delegating - you wonâ\u0080\u0099t hesitate to get your hands dirty; diving into product reviews, writing business cases, helping unblock teams, etc.</li><li>Bring creative new ideas to solve complex problems that haven't been solved before in Canada</li><li>Ensure we build the right things, the right way, at the right time - balancing short-term wins with long-term platform evolution.</li><li>Lead the product team through the full product lifecycle: problem definition, discovery, solution design, scoping, execution, launch, and iteration</li><li>Collaborate closely with Product Design to build best-in-class customer experiences</li><li>Write clear, actionable product specs that connect business goals, customer needs, and technical constraints</li><li>Partner closely with engineering management to ensure initiatives are well-scoped, appropriately sized, and resilient</li><li>Coordinate go-to-market with Growth, CS, and Operations, ensuring launches are operationally ready and well-supported</li><li><b>Measurement, Experimentation and Iteration:</b></li><li>Define success metrics and measurement plans for each initiative, including impact on funnel conversion, loss ratios, LTV, and operational efficiency</li><li>Design and run experiments (e.g. A/B tests) to validate hypotheses and derisk larger bets</li><li>Partner with Data to build dashboards, analyze performance, and translate results into next steps - including when to pivot, double down, or sunset work</li></ul><p><br></p><b>What we are looking for</b><ul><li>8+ years of extensive product management experience in similar roles</li><li>Track record of success in growing D2C digital products and building best-in-class experiences. Nice to have experience in fintech or insurtech; but not required.</li><li>Experience scaling products and product teams at high-growth companies <i>(e.g., Series A-D startups or tech-forward incumbents)</i>.</li><li>Proven ability to develop and communicate a product vision that inspires both internal teams and external stakeholders.</li><li>Strong business acumen - you understand how product connects to revenue, operations, customer success, and compliance.</li><li>Comfortable leading through ambiguity and structuring ambiguous problems into measurable outcomes.</li><li>Data-driven decision-maker with fluency in OKRs, KPIs, funnels, and experimentation.</li><li>Adept at prioritizing tradeoffs, managing competing needs, and maintaining velocity without sacrificing quality.</li><li>High emotional intelligence with a collaborative, transparent leadership style.</li><li>Strong communicator who can tailor messages to executives, engineers, marketers, and everyone in between.</li><li>Committed to building a diverse, inclusive, and mission-driven team culture.</li></ul><p><br></p><b>Why join us</b><ul><li>Generous PTO - 20 vacation days</li><li>A comprehensive benefits plan with premiums paid in full by PolicyMe</li><li>Investment in your professional development, including an L&amp;D budget, AI tooling budget, performance reviews twice a year and ongoing feedback to ensure you reach your highest potential</li><li>An extremely high performing, low-ego, remote-first team that is truly disrupting an old industry</li><li>Option to work from home or our Toronto-based office (bonus: we cover the costs to bring all our employees in-person twice a year for experiential socials!)</li><li>Access to stock options based on performance</li></ul><p><br></p><p></p>\\n<p><b>About PolicyMe:</b></p><p>At PolicyMe, we are Canadaâ\u0080\u0099s leading digital insurance solution, offering straightforward and affordable financial protection for families from coast to coast. Our product suite includes Life Insurance, Critical Illness Insurance, and Health &amp; Dental Insurance, all tailored to Canadians' evolving needs. We also offer B2B2C solutions, partnering with organizations to provide seamless digital insurance options. Founded by a team of insurance experts and technology entrepreneurs, PolicyMe is committed to making insurance simpler and more accessible. Since our launch in 2018, we have grown exponentially, selling over $10 billion in insurance coverage to Canadians.</p><p><br></p><p>We are proud of the team weâ\u0080\u0099ve built and are excited for those that are yet to join us. We operate with a remote-first culture, attracting top talent from across Canada. If youâ\u0080\u0099re looking for a fast-paced, collaborative environment, working alongside incredibly ambitious yet humble humans, we may be the right place for you! To learn more, visit&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://www.policyme.com/\">www.policyme.com</a>.</p><p><br></p><p><b>Additional Notes:</b></p><p><b>- Job Vacancy:</b> This role reflects growth in our team and expanded operational scope. Weâ\u0080\u0099re hiring to support increasing demand and continue delivering an exceptional customer experience.</p><p><b>- Commitment to Equal Opportunity:</b> PolicyMe is an equal opportunity employer. We welcome applicants of all backgrounds and provide fair consideration regardless of race, colour, religion, sex, sexual orientation, gender identity, national origin, or disability.</p><p><b>- Accessibility Statement:</b> We are committed to providing an accessible hiring experience. If you require accommodations during the application process, please indicate this in the â\u0080\u009cAdditional Informationâ\u0080\u009d section of your application.</p><p><br></p><p><i>We thank all applicants for their interest, however, only those selected for an interview will be contacted.</i></p><br/><br/>Please mention the word **CLEANLINESS** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "Ontario",
      "apply_url": "https://remoteOK.com/remote-jobs/remote-principal-product-manager-policyme-1129610",
      "salary_min": 0,
      "salary_max": 0,
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-principal-product-manager-policyme-1129610"
    }
  },
  {
    "id": "remoteok_1129609",
    "title": "Product Manager Automotive Vertical",
    "company": "Conversica",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-product-manager-automotive-vertical-conversica-1129609",
    "postedDate": "2026-01-18T08:34:10.631004",
    "fetchedAt": "2026-01-18T08:34:10.631005",
    "raw": {
      "slug": "remote-product-manager-automotive-vertical-conversica-1129609",
      "id": "1129609",
      "epoch": 1768636820,
      "date": "2026-01-17T08:00:20+00:00",
      "company": "Conversica",
      "company_logo": "",
      "position": "Product Manager Automotive Vertical",
      "tags": [
        "manager",
        "saas",
        "technical",
        "leader",
        "management",
        "lead",
        "sales",
        "engineering"
      ],
      "description": "<p><span style=\"font-size: 16px\">Conversica is looking for a </span><b><span style=\"font-size: 16px\">Product Manager, Automotive Vertical</span></b><span style=\"font-size: 16px\"> to own product strategy, discovery, and execution for our Automotive business. This role is ideal for a product leader with deep automotive domain expertise who understands dealer and OEM workflows and can translate customer and market insights into clear product direction.</span></p><p><br></p><p><span style=\"font-size: 16px\">You will own end-to-end product outcomes for the Automotive vertical, partnering closely with Engineering, Sales, Customer Success, and cross-functional stakeholders to deliver customer-driven, scalable solutions. While this role requires strong technical fluency, its primary leverage comes from domain expertise, customer understanding, and prioritization rather than deep platform or infrastructure ownership.</span></p><p><br></p><p><span style=\"font-size: 16px\">Conversica is a fully remote, U.S.-based company, and this role is open to candidates located within the United States.</span></p>\\n<p></p><p><br></p><b>Responsibilities</b><ul><li>Own product strategy, roadmap, and prioritization for the Automotive vertical</li><li>Lead customer discovery through direct customer conversations, market research, and usage insights</li><li>Translate automotive-specific workflows and customer needs into clear product requirements and outcomes</li><li>Partner closely with Engineering to deliver high-quality solutions aligned with vertical priorities</li><li>Collaborate with Sales and Customer Success to ensure product decisions reflect customer needs and revenue impact</li><li>Drive prioritization decisions within the Automotive vertical based on business impact, feasibility, and customer value</li><li>Support go-to-market readiness, enablement, and ongoing iteration for Automotive-focused capabilities</li><li>Represent the Automotive vertical in cross-functional planning and prioritization discussions</li></ul><p><br></p><b>Qualifications</b><ul><li>5â\u0080\u00938+ years of Product Management experience in SaaS or technology-driven environments</li><li>Strong automotive industry experience (e.g., OEM, dealer technology, automotive SaaS, or adjacent domains)</li><li>Proven ability to lead complex, cross-functional initiatives from discovery through delivery</li><li>Strong customer discovery and problem-framing skills</li><li>Comfort operating in fast-moving, ambiguous environments</li><li>Strong communication, prioritization, and stakeholder management skills</li><li>Baseline technical fluency to effectively partner with Engineering and technical product counterparts</li></ul><p><br></p><b>Preferred Qualifications</b><ul><li>Experience working with AI-enabled or data-heavy products</li><li>Experience in B2B SaaS environments serving complex customer workflows</li><li>Experience partnering closely with Sales and Customer Success teams</li><li>Experience working with integrations involving CRM, DMS, or other third-party systems</li></ul><p><br></p><p></p>\\n<p><span style=\"font-size: 16px;\">This is a full-time, exempt position. Compensation is based on a number of factors, including market location, job-related knowledge, skills, and experience. Our compensation reflects the cost of labor across several U.S. geographic markets.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Conversica offers a comprehensive benefits package, including medical, dental, and vision coverage, paid time off and holidays, a 401(k) plan, and equity.</span></p><br/><br/>Please mention the word **AFFORD** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "United States, Remote",
      "apply_url": "https://remoteOK.com/remote-jobs/remote-product-manager-automotive-vertical-conversica-1129609",
      "salary_min": 0,
      "salary_max": 0,
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-product-manager-automotive-vertical-conversica-1129609"
    }
  },
  {
    "id": "remoteok_1129547",
    "title": "Product Manager",
    "company": "Basis Technologies",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547",
    "postedDate": "2026-01-18T08:34:10.631148",
    "fetchedAt": "2026-01-18T08:34:10.631149",
    "raw": {
      "slug": "remote-product-manager-basis-technologies-1129547",
      "id": "1129547",
      "epoch": 1768316415,
      "date": "2026-01-13T15:00:15+00:00",
      "company": "Basis Technologies",
      "company_logo": "",
      "position": "Product Manager",
      "tags": [
        "manager",
        "technical",
        "software",
        "growth",
        "financial",
        "education",
        "management",
        "operational",
        "health"
      ],
      "description": "<p><b>WHO WE ARE&nbsp;</b></p><p><br></p><p>At Basis Technologies, we empower agencies and brands with cutting-edge software that automates digital media operations. Our all-in-one platform supports seamless planning, reporting, and financial reconciliation across direct, programmatic, search, and social media.</p><p><br></p><p>Weâ\u0080\u0099re not just building advanced technology; weâ\u0080\u0099re also building a culture where passionate, motivated individuals come together to drive meaningful change. Our commitment to inclusivity and growth ensures our employees thrive both professionally and personally.</p><p><br></p><p>With our headquarters in Chicago, we offer flexible work options across the U.S. and Canada, including remote, hybrid, or on-site at headquarters.</p><p><br></p><p><b style=\"font-size: 11pt;\">ABOUT THE TEAM</b></p><p><span style=\"font-size: 11pt;\">Basis' Product team guides the innovation and development of our comprehensive tech platform, Basis. This team blends focus, collaboration, and creativity to fulfill our mission in creating a transformative tool that makes work more streamlined and fulfilling for those who power the ad tech industry.</span></p><p><span style=\"font-size: 11pt;\">Customer experience is at the forefront of this teamâ\u0080\u0099s workâ\u0080\u0094and also includes market research, cross-departmental stakeholder collaboration, user testing, communicating feature requests to engineers and designers, monitoring impact of new feature rollouts, measuring returns on product investments, and more. Together, they leverage their diverse industry experience and talent to brainstorm new ideas, iterate on old ones, and create the best possible product for our customers.</span></p><p><span style=\"font-size: 11pt;\">&nbsp;</span></p><p><b style=\"font-size: 11pt;\">WAYS YOUâ\u0080\u0099LL CONTRIBUTE</b></p><p><span style=\"font-size: 11pt;\"> As a Product Manager, you will take ownership of specific product areas, leading initiatives that solve customer problems and drive business outcomes. You will collaborate with cross-functional partners to identify opportunities, shape solutions, and deliver features that create measurable value. You will:</span></p>\\n<p></p><p><br></p><ul><li>Build the business and technical case for the \"why,\" including expected outcomes and success metrics for each project.</li><li>Identify and define valuable features based on user needs and business opportunities.</li><li>Write product requirements with attention to both customer value and internal operational needs.</li><li>Lead cross-functional delivery across Design, Engineering, QA, and Operations.</li><li>Manage intake processes for new ideas and feedback, participating in discovery and validation.</li><li>Maintain product roadmap clarity, communicate priorities, and plan go-to-market readiness.</li><li>Support product adoption through internal education and external-facing materials.</li></ul><p><br></p><b>WHAT YOU BRING TO THE TABLE</b><ul><li>2+ years of experience in product management or a related role.</li><li>Ability to drive products through the entire lifecycle from concept to delivery.</li><li>Strong collaboration, analytical, and communication skills.</li><li>Familiarity with technical systems, including databases, APIs, and performance tradeoffs.</li><li>Commitment to creating inclusive, respectful environments where all voices are valued and supported.</li><li>Thoughtful approach to collaboration, design, and decision-making that prioritizes equity, access, and continuous learning.</li></ul><p><br></p><b>BONUS POINTS</b><ul><li>Bachelorâ\u0080\u0099s degree in computer science or related field.</li><li>Knowledge of ad tech, B2B SaaS, or media platforms.</li></ul><p><br></p><p></p>\\n<div>$88,944 - $138,753 a year</div><small><div><span style=\"font-size: 11pt;\">This salary range reflects a typical compensation range for the role and level in most U.S. locations. Final compensation offered will depend on your location, experience, and skills. Total compensation may also include bonuses, equity, and competitive benefits.</span></div></small>\\n<p><b style=\"font-size: 16px;\">Integrity in Hiring</b></p><p><span style=\"font-size: 16px;\"> At Basis, integrity is at the core of how we hire. To protect our candidates and our company, we verify identity, education, and employment history for all hires. Some roles may also require onsite or in-person interviews as part of the process. Any misrepresentation of identity, experience, or skills may result in removal from the hiring process or termination of employment. We value transparency and authenticity and expect the same from every applicant.</span></p><p><br></p><p><span style=\"font-size: 16px;\"><b>Anything Else?</b></span></p><p><span style=\"font-size: 16px;\">Donâ\u0080\u0099t have every skill listed? No problem! We know experience can be built in many ways. If you have relevant skills that aren't reflected in your resume, we encourage you to share them in an optional cover letter.&nbsp;&nbsp;</span></p><p><br></p><p><b><span style=\"font-size: 16px;\">Life with Basis Technologies</span></b></p><p><span style=\"font-size: 16px;\">Weâ\u0080\u0099re committed to our peopleâ\u0080\u0099s growth and well-being because our success is tied to theirs. Thatâ\u0080\u0099s why weâ\u0080\u0099ve earned recognition as a top workplace, including: Ad Age, #1 Best Places to Work 2025, WorkLife's #1 Most Committed to Work Life Balance, and the Chicago Tribune's Top Workplaces in Chicago. We offer competitive perks, including a flexible work week, 401k/RRSP matching, mental health support, paid sabbaticals, generous parental leave, flexible work options, and more.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Basis is proud to be an equal-opportunity employer. We celebrate all team members regardless of gender identity, sexual orientation, race or cultural background, religion, disability, age, and beyond.</span></p><p><br></p><p><span style=\"font-size: 16px;\">If you need assistance with interview accessibility, please contact&nbsp;</span><a href=\"http://talent.acquisition/\"><span style=\"font-size: 16px;\">talent.acquisition</span></a><span style=\"font-size: 16px;\">@basis.com. Your privacy is important to us, view our policy </span><a class=\"postings-link\" href=\"https://privacy.basis.net/\"><span style=\"font-size: 16px;\">here</span></a><span style=\"font-size: 16px;\">.</span></p><br/><br/>Please mention the word **SUBLIME** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "",
      "apply_url": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547",
      "salary_min": 0,
      "salary_max": 0,
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547"
    }
  },
  {
    "id": "remoteok_1129523",
    "title": "Staff Product Manager",
    "company": "ZenBusiness Inc.",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523",
    "postedDate": "2026-01-18T08:34:10.631219",
    "fetchedAt": "2026-01-18T08:34:10.631220",
    "raw": {
      "slug": "remote-staff-product-manager-zenbusiness-inc-1129523",
      "id": "1129523",
      "epoch": 1768226418,
      "date": "2026-01-12T14:00:18+00:00",
      "company": "ZenBusiness Inc.",
      "company_logo": "",
      "position": "Staff Product Manager",
      "tags": [
        "manager",
        "testing",
        "test",
        "growth",
        "ux",
        "leader",
        "lead",
        "marketing",
        "excel",
        "engineering"
      ],
      "description": "<p><strong>Who We Are</strong></p>\n<p>We started our company to help others launch and run their own businesses, at any stage. The way we help is by keeping it simple and supporting entrepreneurs one step at a time. Put simply: our mission is to enable anyone to start, run, and grow their business while avoiding the common pitfalls that derail hopeful entrepreneurs. No more having to wade through forms, taxes, or ongoing state compliance.&nbsp;</p>\n<p>We are a remote company based in Austin, Texas. We have team members from Florida to Oregon and all points in-between. Take pride in your work knowing that it shapes how people all across the country reach their goal of starting, running, and growing their business.&nbsp;&nbsp;</p>\n<p>If the idea of helping people and working with a genuinely caring, supportive team excites you, then youâ\u0080\u0099ve come to the right place.</p>\n<div><p><strong>The Role</strong></p>\n<p>Come join our ZenBusiness product team as a Growth Product Manager focusing on our LLC and corporation funnels. We are looking for a product leader who is steeped in the latest product-led growth techniques and also has great sensibilities in online customer acquisition and conversion rate optimization tactics.</p>\n<p>Your primary focus will be on identifying new growth opportunities to help us turn site visitors into first-time business owners. Youâ\u0080\u0099ll excel in this role if you thrive in a fast-paced environment where you enjoy owning the product lifecycle, along with business impact from idea through execution.&nbsp;</p>\n<p>This position will report to the VP of Product and is a remote role.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li><strong>Own our new customer and post-purchase funnels. </strong>Establish and execute a 3-month rolling roadmap of projects for our funnel platform to increase our customer volume and improve average revenue per customer in their first 30 days.</li>\n<li><strong>A/B testing &amp; experimentation:</strong> Lead experimentation efforts with Product &amp; Engineering to test new features &amp; UX optimizations that improve the conversion rate of visitors who start our funnel.</li>\n<li><strong>Checkout &amp; payment acceptance optimization: </strong>Streamline our checkout flows by eliminating cognitive load and ensuring customers can complete purchases with their preferred payment methodâ\u0080\u0094whether thatâ\u0080\u0099s credit card, Apple Pay, Google Pay, or other device-optimized options. Act as a thought leader across the company when it comes to checkout and payment acceptance.</li>\n<li><strong>Lead to conversion rate optimization efforts:</strong> Work closely with marketing and product teams to identify and implement strategies that drive conversion rates and improve customer experience.</li>\n</ul><br/><br/>Please mention the word **CLEVERLY** and tag RMzguNjguMTM0LjE5NA== when applying to show you read the job post completely (#RMzguNjguMTM0LjE5NA==). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "Remote",
      "salary_min": 80000,
      "salary_max": 120000,
      "apply_url": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523",
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523"
    }
  },
  {
    "id": "yc_8416049188714008200",
    "title": "Product Manager Jobs in San Francisco",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/san-francisco",
    "postedDate": "2026-01-18T08:34:11.470263",
    "fetchedAt": "2026-01-18T08:34:11.470264"
  },
  {
    "id": "yc_7635964637315543339",
    "title": "Product Manager Jobs in New York",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/new-york",
    "postedDate": "2026-01-18T08:34:11.470281",
    "fetchedAt": "2026-01-18T08:34:11.470282"
  },
  {
    "id": "yc_-3570139050978040255",
    "title": "Product Manager Jobs in Los Angeles",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/los-angeles",
    "postedDate": "2026-01-18T08:34:11.470297",
    "fetchedAt": "2026-01-18T08:34:11.470298"
  },
  {
    "id": "yc_-2583107277104731953",
    "title": "RemoteProduct ManagerJobs",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/remote",
    "postedDate": "2026-01-18T08:34:11.470321",
    "fetchedAt": "2026-01-18T08:34:11.470322"
  }
]