[
  {
    "id": "remoteok_1129547",
    "title": "Product Manager",
    "company": "Basis Technologies",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547",
    "postedDate": "2026-01-17T16:30:40.164101",
    "fetchedAt": "2026-01-17T16:30:40.164102",
    "raw": {
      "slug": "remote-product-manager-basis-technologies-1129547",
      "id": "1129547",
      "epoch": 1768316415,
      "date": "2026-01-13T15:00:15+00:00",
      "company": "Basis Technologies",
      "company_logo": "",
      "position": "Product Manager",
      "tags": [
        "manager",
        "technical",
        "software",
        "growth",
        "financial",
        "education",
        "management",
        "operational",
        "health"
      ],
      "description": "<p><b>WHO WE ARE&nbsp;</b></p><p><br></p><p>At Basis Technologies, we empower agencies and brands with cutting-edge software that automates digital media operations. Our all-in-one platform supports seamless planning, reporting, and financial reconciliation across direct, programmatic, search, and social media.</p><p><br></p><p>Weâ\u0080\u0099re not just building advanced technology; weâ\u0080\u0099re also building a culture where passionate, motivated individuals come together to drive meaningful change. Our commitment to inclusivity and growth ensures our employees thrive both professionally and personally.</p><p><br></p><p>With our headquarters in Chicago, we offer flexible work options across the U.S. and Canada, including remote, hybrid, or on-site at headquarters.</p><p><br></p><p><b style=\"font-size: 11pt;\">ABOUT THE TEAM</b></p><p><span style=\"font-size: 11pt;\">Basis' Product team guides the innovation and development of our comprehensive tech platform, Basis. This team blends focus, collaboration, and creativity to fulfill our mission in creating a transformative tool that makes work more streamlined and fulfilling for those who power the ad tech industry.</span></p><p><span style=\"font-size: 11pt;\">Customer experience is at the forefront of this teamâ\u0080\u0099s workâ\u0080\u0094and also includes market research, cross-departmental stakeholder collaboration, user testing, communicating feature requests to engineers and designers, monitoring impact of new feature rollouts, measuring returns on product investments, and more. Together, they leverage their diverse industry experience and talent to brainstorm new ideas, iterate on old ones, and create the best possible product for our customers.</span></p><p><span style=\"font-size: 11pt;\">&nbsp;</span></p><p><b style=\"font-size: 11pt;\">WAYS YOUâ\u0080\u0099LL CONTRIBUTE</b></p><p><span style=\"font-size: 11pt;\"> As a Product Manager, you will take ownership of specific product areas, leading initiatives that solve customer problems and drive business outcomes. You will collaborate with cross-functional partners to identify opportunities, shape solutions, and deliver features that create measurable value. You will:</span></p>\\n<p></p><p><br></p><ul><li>Build the business and technical case for the \"why,\" including expected outcomes and success metrics for each project.</li><li>Identify and define valuable features based on user needs and business opportunities.</li><li>Write product requirements with attention to both customer value and internal operational needs.</li><li>Lead cross-functional delivery across Design, Engineering, QA, and Operations.</li><li>Manage intake processes for new ideas and feedback, participating in discovery and validation.</li><li>Maintain product roadmap clarity, communicate priorities, and plan go-to-market readiness.</li><li>Support product adoption through internal education and external-facing materials.</li></ul><p><br></p><b>WHAT YOU BRING TO THE TABLE</b><ul><li>2+ years of experience in product management or a related role.</li><li>Ability to drive products through the entire lifecycle from concept to delivery.</li><li>Strong collaboration, analytical, and communication skills.</li><li>Familiarity with technical systems, including databases, APIs, and performance tradeoffs.</li><li>Commitment to creating inclusive, respectful environments where all voices are valued and supported.</li><li>Thoughtful approach to collaboration, design, and decision-making that prioritizes equity, access, and continuous learning.</li></ul><p><br></p><b>BONUS POINTS</b><ul><li>Bachelorâ\u0080\u0099s degree in computer science or related field.</li><li>Knowledge of ad tech, B2B SaaS, or media platforms.</li></ul><p><br></p><p></p>\\n<div>$88,944 - $138,753 a year</div><small><div><span style=\"font-size: 11pt;\">This salary range reflects a typical compensation range for the role and level in most U.S. locations. Final compensation offered will depend on your location, experience, and skills. Total compensation may also include bonuses, equity, and competitive benefits.</span></div></small>\\n<p><b style=\"font-size: 16px;\">Integrity in Hiring</b></p><p><span style=\"font-size: 16px;\"> At Basis, integrity is at the core of how we hire. To protect our candidates and our company, we verify identity, education, and employment history for all hires. Some roles may also require onsite or in-person interviews as part of the process. Any misrepresentation of identity, experience, or skills may result in removal from the hiring process or termination of employment. We value transparency and authenticity and expect the same from every applicant.</span></p><p><br></p><p><span style=\"font-size: 16px;\"><b>Anything Else?</b></span></p><p><span style=\"font-size: 16px;\">Donâ\u0080\u0099t have every skill listed? No problem! We know experience can be built in many ways. If you have relevant skills that aren't reflected in your resume, we encourage you to share them in an optional cover letter.&nbsp;&nbsp;</span></p><p><br></p><p><b><span style=\"font-size: 16px;\">Life with Basis Technologies</span></b></p><p><span style=\"font-size: 16px;\">Weâ\u0080\u0099re committed to our peopleâ\u0080\u0099s growth and well-being because our success is tied to theirs. Thatâ\u0080\u0099s why weâ\u0080\u0099ve earned recognition as a top workplace, including: Ad Age, #1 Best Places to Work 2025, WorkLife's #1 Most Committed to Work Life Balance, and the Chicago Tribune's Top Workplaces in Chicago. We offer competitive perks, including a flexible work week, 401k/RRSP matching, mental health support, paid sabbaticals, generous parental leave, flexible work options, and more.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Basis is proud to be an equal-opportunity employer. We celebrate all team members regardless of gender identity, sexual orientation, race or cultural background, religion, disability, age, and beyond.</span></p><p><br></p><p><span style=\"font-size: 16px;\">If you need assistance with interview accessibility, please contact&nbsp;</span><a href=\"http://talent.acquisition/\"><span style=\"font-size: 16px;\">talent.acquisition</span></a><span style=\"font-size: 16px;\">@basis.com. Your privacy is important to us, view our policy </span><a class=\"postings-link\" href=\"https://privacy.basis.net/\"><span style=\"font-size: 16px;\">here</span></a><span style=\"font-size: 16px;\">.</span></p><br/><br/>Please mention the word **SUBLIME** and tag RNTIuMTU5LjI0NS4xNzg= when applying to show you read the job post completely (#RNTIuMTU5LjI0NS4xNzg=). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "",
      "apply_url": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547",
      "salary_min": 0,
      "salary_max": 0,
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-product-manager-basis-technologies-1129547"
    }
  },
  {
    "id": "remoteok_1129523",
    "title": "Staff Product Manager",
    "company": "ZenBusiness Inc.",
    "location": "Remote",
    "source": "RemoteOK",
    "applyLink": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523",
    "postedDate": "2026-01-17T16:30:40.164162",
    "fetchedAt": "2026-01-17T16:30:40.164163",
    "raw": {
      "slug": "remote-staff-product-manager-zenbusiness-inc-1129523",
      "id": "1129523",
      "epoch": 1768226418,
      "date": "2026-01-12T14:00:18+00:00",
      "company": "ZenBusiness Inc.",
      "company_logo": "",
      "position": "Staff Product Manager",
      "tags": [
        "manager",
        "testing",
        "test",
        "growth",
        "ux",
        "leader",
        "lead",
        "marketing",
        "excel",
        "engineering"
      ],
      "description": "<p><strong>Who We Are</strong></p>\n<p>We started our company to help others launch and run their own businesses, at any stage. The way we help is by keeping it simple and supporting entrepreneurs one step at a time. Put simply: our mission is to enable anyone to start, run, and grow their business while avoiding the common pitfalls that derail hopeful entrepreneurs. No more having to wade through forms, taxes, or ongoing state compliance.&nbsp;</p>\n<p>We are a remote company based in Austin, Texas. We have team members from Florida to Oregon and all points in-between. Take pride in your work knowing that it shapes how people all across the country reach their goal of starting, running, and growing their business.&nbsp;&nbsp;</p>\n<p>If the idea of helping people and working with a genuinely caring, supportive team excites you, then youâ\u0080\u0099ve come to the right place.</p>\n<div><p><strong>The Role</strong></p>\n<p>Come join our ZenBusiness product team as a Growth Product Manager focusing on our LLC and corporation funnels. We are looking for a product leader who is steeped in the latest product-led growth techniques and also has great sensibilities in online customer acquisition and conversion rate optimization tactics.</p>\n<p>Your primary focus will be on identifying new growth opportunities to help us turn site visitors into first-time business owners. Youâ\u0080\u0099ll excel in this role if you thrive in a fast-paced environment where you enjoy owning the product lifecycle, along with business impact from idea through execution.&nbsp;</p>\n<p>This position will report to the VP of Product and is a remote role.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li><strong>Own our new customer and post-purchase funnels. </strong>Establish and execute a 3-month rolling roadmap of projects for our funnel platform to increase our customer volume and improve average revenue per customer in their first 30 days.</li>\n<li><strong>A/B testing &amp; experimentation:</strong> Lead experimentation efforts with Product &amp; Engineering to test new features &amp; UX optimizations that improve the conversion rate of visitors who start our funnel.</li>\n<li><strong>Checkout &amp; payment acceptance optimization: </strong>Streamline our checkout flows by eliminating cognitive load and ensuring customers can complete purchases with their preferred payment methodâ\u0080\u0094whether thatâ\u0080\u0099s credit card, Apple Pay, Google Pay, or other device-optimized options. Act as a thought leader across the company when it comes to checkout and payment acceptance.</li>\n<li><strong>Lead to conversion rate optimization efforts:</strong> Work closely with marketing and product teams to identify and implement strategies that drive conversion rates and improve customer experience.</li>\n</ul><br/><br/>Please mention the word **CLEVERLY** and tag RNTIuMTU5LjI0NS4xNzg= when applying to show you read the job post completely (#RNTIuMTU5LjI0NS4xNzg=). This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they're human.",
      "location": "Remote",
      "salary_min": 80000,
      "salary_max": 120000,
      "apply_url": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523",
      "logo": "",
      "url": "https://remoteOK.com/remote-jobs/remote-staff-product-manager-zenbusiness-inc-1129523"
    }
  },
  {
    "id": "yc_-7461006196918497245",
    "title": "Product Manager Jobs in San Francisco",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/san-francisco",
    "postedDate": "2026-01-17T16:30:40.464098",
    "fetchedAt": "2026-01-17T16:30:40.464098"
  },
  {
    "id": "yc_-2295278905748595204",
    "title": "Product Manager Jobs in New York",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/new-york",
    "postedDate": "2026-01-17T16:30:40.464117",
    "fetchedAt": "2026-01-17T16:30:40.464118"
  },
  {
    "id": "yc_352129598304174187",
    "title": "Product Manager Jobs in Los Angeles",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/los-angeles",
    "postedDate": "2026-01-17T16:30:40.464135",
    "fetchedAt": "2026-01-17T16:30:40.464135"
  },
  {
    "id": "yc_-7331095546548329702",
    "title": "RemoteProduct ManagerJobs",
    "company": null,
    "location": null,
    "source": "YCombinator",
    "applyLink": "https://www.ycombinator.com/jobs/role/product-manager/remote",
    "postedDate": "2026-01-17T16:30:40.464156",
    "fetchedAt": "2026-01-17T16:30:40.464157"
  }
]